app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Nguyen Quoc Trung"], ["comment", "This is my first comment"], ["created_at", "2018-06-03 18:09:36.647269"], ["updated_at", "2018-06-03 18:09:36.647269"], ["post_id", 4]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :comment))