app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First post"], ["content", "Test post content"], ["created_at", "2018-06-03 15:25:56.162029"], ["updated_at", "2018-06-03 15:25:56.162029"]]
---
	def create
		@post = Post.new(post_params)

		if @post.save